###################################################################

# Created by write_sdc on Fri Jan 30 09:56:11 2026

###################################################################
set sdc_version 2.1

set_units -time ps -capacitance fF
set_max_area 0
create_clock [get_ports clk_i]  -period 2000  -waveform {0 1000}
set_clock_uncertainty -setup 100  [get_clocks clk_i]
set_input_delay -clock clk_i  280  [get_ports clk_i]
set_input_delay -clock clk_i  280  [get_ports rst_ni]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[31]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[30]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[29]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[28]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[27]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[26]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[25]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[24]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[23]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[22]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[21]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[20]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[19]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[18]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[17]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[16]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[15]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[14]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[13]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[12]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[11]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[10]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[9]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[8]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[7]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[6]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[5]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[4]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[3]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[2]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[1]}]
set_input_delay -clock clk_i  280  [get_ports {hart_id_i[0]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[31]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[30]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[29]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[28]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[27]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[26]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[25]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[24]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[23]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[22]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[21]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[20]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[19]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[18]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[17]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[16]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[15]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[14]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[13]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[12]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[11]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[10]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[9]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[8]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[7]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[6]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[5]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[4]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[3]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[2]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[1]}]
set_input_delay -clock clk_i  280  [get_ports {boot_addr_i[0]}]
set_input_delay -clock clk_i  280  [get_ports instr_gnt_i]
set_input_delay -clock clk_i  280  [get_ports instr_rvalid_i]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[31]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[30]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[29]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[28]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[27]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[26]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[25]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[24]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[23]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[22]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[21]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[20]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[19]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[18]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[17]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[16]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[15]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[14]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[13]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[12]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[11]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[10]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[9]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[8]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[7]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[6]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[5]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[4]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[3]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[2]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[1]}]
set_input_delay -clock clk_i  280  [get_ports {instr_rdata_i[0]}]
set_input_delay -clock clk_i  280  [get_ports instr_err_i]
set_input_delay -clock clk_i  280  [get_ports data_gnt_i]
set_input_delay -clock clk_i  280  [get_ports data_rvalid_i]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[31]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[30]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[29]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[28]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[27]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[26]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[25]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[24]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[23]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[22]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[21]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[20]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[19]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[18]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[17]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[16]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[15]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[14]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[13]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[12]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[11]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[10]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[9]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[8]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[7]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[6]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[5]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[4]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[3]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[2]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[1]}]
set_input_delay -clock clk_i  280  [get_ports {data_rdata_i[0]}]
set_input_delay -clock clk_i  280  [get_ports data_err_i]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[31]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[30]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[29]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[28]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[27]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[26]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[25]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[24]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[23]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[22]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[21]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[20]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[19]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[18]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[17]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[16]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[15]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[14]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[13]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[12]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[11]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[10]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[9]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[8]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[7]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[6]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[5]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[4]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[3]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[2]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[1]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_a_ecc_i[0]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[31]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[30]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[29]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[28]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[27]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[26]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[25]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[24]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[23]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[22]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[21]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[20]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[19]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[18]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[17]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[16]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[15]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[14]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[13]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[12]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[11]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[10]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[9]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[8]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[7]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[6]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[5]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[4]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[3]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[2]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[1]}]
set_input_delay -clock clk_i  280  [get_ports {rf_rdata_b_ecc_i[0]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[43]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[42]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[41]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[40]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[39]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[38]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[37]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[36]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[35]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[34]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[33]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[32]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[31]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[30]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[29]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[28]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[27]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[26]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[25]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[24]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[23]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[22]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[21]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[20]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[19]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[18]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[17]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[16]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[15]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[14]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[13]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[12]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[11]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[10]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[9]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[8]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[7]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[6]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[5]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[4]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[3]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[2]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[1]}]
set_input_delay -clock clk_i  280  [get_ports {ic_tag_rdata_i[0]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[127]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[126]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[125]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[124]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[123]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[122]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[121]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[120]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[119]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[118]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[117]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[116]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[115]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[114]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[113]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[112]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[111]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[110]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[109]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[108]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[107]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[106]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[105]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[104]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[103]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[102]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[101]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[100]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[99]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[98]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[97]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[96]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[95]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[94]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[93]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[92]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[91]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[90]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[89]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[88]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[87]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[86]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[85]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[84]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[83]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[82]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[81]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[80]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[79]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[78]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[77]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[76]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[75]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[74]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[73]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[72]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[71]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[70]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[69]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[68]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[67]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[66]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[65]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[64]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[63]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[62]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[61]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[60]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[59]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[58]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[57]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[56]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[55]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[54]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[53]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[52]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[51]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[50]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[49]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[48]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[47]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[46]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[45]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[44]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[43]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[42]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[41]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[40]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[39]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[38]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[37]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[36]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[35]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[34]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[33]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[32]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[31]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[30]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[29]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[28]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[27]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[26]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[25]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[24]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[23]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[22]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[21]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[20]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[19]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[18]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[17]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[16]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[15]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[14]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[13]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[12]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[11]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[10]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[9]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[8]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[7]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[6]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[5]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[4]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[3]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[2]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[1]}]
set_input_delay -clock clk_i  280  [get_ports {ic_data_rdata_i[0]}]
set_input_delay -clock clk_i  280  [get_ports ic_scr_key_valid_i]
set_input_delay -clock clk_i  280  [get_ports irq_software_i]
set_input_delay -clock clk_i  280  [get_ports irq_timer_i]
set_input_delay -clock clk_i  280  [get_ports irq_external_i]
set_input_delay -clock clk_i  280  [get_ports {irq_fast_i[14]}]
set_input_delay -clock clk_i  280  [get_ports {irq_fast_i[13]}]
set_input_delay -clock clk_i  280  [get_ports {irq_fast_i[12]}]
set_input_delay -clock clk_i  280  [get_ports {irq_fast_i[11]}]
set_input_delay -clock clk_i  280  [get_ports {irq_fast_i[10]}]
set_input_delay -clock clk_i  280  [get_ports {irq_fast_i[9]}]
set_input_delay -clock clk_i  280  [get_ports {irq_fast_i[8]}]
set_input_delay -clock clk_i  280  [get_ports {irq_fast_i[7]}]
set_input_delay -clock clk_i  280  [get_ports {irq_fast_i[6]}]
set_input_delay -clock clk_i  280  [get_ports {irq_fast_i[5]}]
set_input_delay -clock clk_i  280  [get_ports {irq_fast_i[4]}]
set_input_delay -clock clk_i  280  [get_ports {irq_fast_i[3]}]
set_input_delay -clock clk_i  280  [get_ports {irq_fast_i[2]}]
set_input_delay -clock clk_i  280  [get_ports {irq_fast_i[1]}]
set_input_delay -clock clk_i  280  [get_ports {irq_fast_i[0]}]
set_input_delay -clock clk_i  280  [get_ports irq_nm_i]
set_input_delay -clock clk_i  280  [get_ports debug_req_i]
set_input_delay -clock clk_i  280  [get_ports {fetch_enable_i[3]}]
set_input_delay -clock clk_i  280  [get_ports {fetch_enable_i[2]}]
set_input_delay -clock clk_i  280  [get_ports {fetch_enable_i[1]}]
set_input_delay -clock clk_i  280  [get_ports {fetch_enable_i[0]}]
set_output_delay -clock clk_i  280  [get_ports instr_req_o]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[31]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[30]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[29]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[28]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[27]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[26]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[25]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[24]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[23]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[22]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[21]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[20]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[19]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[18]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[17]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[16]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[15]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[14]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[13]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[12]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[11]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[10]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[9]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[8]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[7]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[6]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[5]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[4]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[3]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[2]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[1]}]
set_output_delay -clock clk_i  280  [get_ports {instr_addr_o[0]}]
set_output_delay -clock clk_i  280  [get_ports data_req_o]
set_output_delay -clock clk_i  280  [get_ports data_we_o]
set_output_delay -clock clk_i  280  [get_ports {data_be_o[3]}]
set_output_delay -clock clk_i  280  [get_ports {data_be_o[2]}]
set_output_delay -clock clk_i  280  [get_ports {data_be_o[1]}]
set_output_delay -clock clk_i  280  [get_ports {data_be_o[0]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[31]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[30]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[29]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[28]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[27]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[26]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[25]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[24]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[23]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[22]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[21]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[20]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[19]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[18]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[17]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[16]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[15]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[14]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[13]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[12]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[11]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[10]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[9]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[8]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[7]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[6]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[5]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[4]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[3]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[2]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[1]}]
set_output_delay -clock clk_i  280  [get_ports {data_addr_o[0]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[31]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[30]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[29]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[28]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[27]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[26]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[25]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[24]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[23]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[22]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[21]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[20]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[19]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[18]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[17]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[16]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[15]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[14]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[13]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[12]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[11]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[10]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[9]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[8]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[7]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[6]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[5]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[4]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[3]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[2]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[1]}]
set_output_delay -clock clk_i  280  [get_ports {data_wdata_o[0]}]
set_output_delay -clock clk_i  280  [get_ports dummy_instr_id_o]
set_output_delay -clock clk_i  280  [get_ports dummy_instr_wb_o]
set_output_delay -clock clk_i  280  [get_ports {rf_raddr_a_o[4]}]
set_output_delay -clock clk_i  280  [get_ports {rf_raddr_a_o[3]}]
set_output_delay -clock clk_i  280  [get_ports {rf_raddr_a_o[2]}]
set_output_delay -clock clk_i  280  [get_ports {rf_raddr_a_o[1]}]
set_output_delay -clock clk_i  280  [get_ports {rf_raddr_a_o[0]}]
set_output_delay -clock clk_i  280  [get_ports {rf_raddr_b_o[4]}]
set_output_delay -clock clk_i  280  [get_ports {rf_raddr_b_o[3]}]
set_output_delay -clock clk_i  280  [get_ports {rf_raddr_b_o[2]}]
set_output_delay -clock clk_i  280  [get_ports {rf_raddr_b_o[1]}]
set_output_delay -clock clk_i  280  [get_ports {rf_raddr_b_o[0]}]
set_output_delay -clock clk_i  280  [get_ports {rf_waddr_wb_o[4]}]
set_output_delay -clock clk_i  280  [get_ports {rf_waddr_wb_o[3]}]
set_output_delay -clock clk_i  280  [get_ports {rf_waddr_wb_o[2]}]
set_output_delay -clock clk_i  280  [get_ports {rf_waddr_wb_o[1]}]
set_output_delay -clock clk_i  280  [get_ports {rf_waddr_wb_o[0]}]
set_output_delay -clock clk_i  280  [get_ports rf_we_wb_o]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[31]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[30]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[29]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[28]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[27]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[26]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[25]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[24]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[23]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[22]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[21]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[20]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[19]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[18]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[17]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[16]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[15]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[14]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[13]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[12]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[11]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[10]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[9]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[8]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[7]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[6]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[5]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[4]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[3]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[2]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[1]}]
set_output_delay -clock clk_i  280  [get_ports {rf_wdata_wb_ecc_o[0]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_req_o[1]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_req_o[0]}]
set_output_delay -clock clk_i  280  [get_ports ic_tag_write_o]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_addr_o[7]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_addr_o[6]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_addr_o[5]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_addr_o[4]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_addr_o[3]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_addr_o[2]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_addr_o[1]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_addr_o[0]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[21]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[20]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[19]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[18]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[17]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[16]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[15]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[14]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[13]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[12]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[11]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[10]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[9]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[8]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[7]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[6]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[5]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[4]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[3]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[2]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[1]}]
set_output_delay -clock clk_i  280  [get_ports {ic_tag_wdata_o[0]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_req_o[1]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_req_o[0]}]
set_output_delay -clock clk_i  280  [get_ports ic_data_write_o]
set_output_delay -clock clk_i  280  [get_ports {ic_data_addr_o[7]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_addr_o[6]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_addr_o[5]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_addr_o[4]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_addr_o[3]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_addr_o[2]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_addr_o[1]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_addr_o[0]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[63]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[62]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[61]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[60]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[59]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[58]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[57]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[56]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[55]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[54]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[53]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[52]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[51]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[50]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[49]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[48]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[47]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[46]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[45]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[44]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[43]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[42]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[41]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[40]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[39]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[38]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[37]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[36]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[35]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[34]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[33]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[32]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[31]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[30]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[29]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[28]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[27]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[26]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[25]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[24]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[23]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[22]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[21]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[20]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[19]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[18]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[17]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[16]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[15]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[14]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[13]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[12]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[11]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[10]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[9]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[8]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[7]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[6]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[5]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[4]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[3]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[2]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[1]}]
set_output_delay -clock clk_i  280  [get_ports {ic_data_wdata_o[0]}]
set_output_delay -clock clk_i  280  [get_ports ic_scr_key_req_o]
set_output_delay -clock clk_i  280  [get_ports irq_pending_o]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[159]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[158]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[157]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[156]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[155]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[154]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[153]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[152]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[151]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[150]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[149]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[148]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[147]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[146]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[145]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[144]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[143]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[142]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[141]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[140]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[139]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[138]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[137]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[136]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[135]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[134]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[133]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[132]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[131]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[130]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[129]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[128]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[127]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[126]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[125]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[124]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[123]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[122]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[121]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[120]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[119]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[118]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[117]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[116]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[115]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[114]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[113]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[112]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[111]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[110]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[109]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[108]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[107]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[106]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[105]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[104]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[103]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[102]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[101]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[100]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[99]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[98]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[97]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[96]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[95]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[94]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[93]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[92]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[91]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[90]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[89]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[88]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[87]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[86]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[85]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[84]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[83]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[82]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[81]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[80]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[79]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[78]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[77]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[76]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[75]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[74]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[73]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[72]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[71]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[70]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[69]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[68]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[67]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[66]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[65]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[64]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[63]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[62]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[61]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[60]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[59]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[58]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[57]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[56]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[55]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[54]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[53]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[52]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[51]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[50]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[49]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[48]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[47]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[46]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[45]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[44]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[43]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[42]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[41]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[40]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[39]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[38]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[37]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[36]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[35]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[34]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[33]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[32]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[31]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[30]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[29]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[28]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[27]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[26]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[25]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[24]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[23]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[22]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[21]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[20]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[19]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[18]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[17]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[16]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[15]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[14]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[13]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[12]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[11]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[10]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[9]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[8]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[7]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[6]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[5]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[4]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[3]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[2]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[1]}]
set_output_delay -clock clk_i  280  [get_ports {crash_dump_o[0]}]
set_output_delay -clock clk_i  280  [get_ports double_fault_seen_o]
set_output_delay -clock clk_i  280  [get_ports alert_minor_o]
set_output_delay -clock clk_i  280  [get_ports alert_major_internal_o]
set_output_delay -clock clk_i  280  [get_ports alert_major_bus_o]
set_output_delay -clock clk_i  280  [get_ports {core_busy_o[3]}]
set_output_delay -clock clk_i  280  [get_ports {core_busy_o[2]}]
set_output_delay -clock clk_i  280  [get_ports {core_busy_o[1]}]
set_output_delay -clock clk_i  280  [get_ports {core_busy_o[0]}]
