###################################################################

# Created by write_sdc on Sat Jan 31 01:25:25 2026

###################################################################
set sdc_version 2.1

set_units -time ps -capacitance fF
set_max_area 0
create_clock [get_ports clk]  -period 2000  -waveform {0 1000}
set_clock_uncertainty -setup 100  [get_clocks clk]
set_input_delay -clock clk  280  [get_ports clk]
set_input_delay -clock clk  280  [get_ports rst]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[31]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[30]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[29]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[28]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[27]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[26]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[25]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[24]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[23]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[22]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[21]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[20]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[19]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[18]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[17]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[16]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[15]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[14]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[13]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[12]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[11]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[10]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[9]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[8]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[7]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[6]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[5]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[4]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[3]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[2]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[1]}]
set_input_delay -clock clk  280  [get_ports {icpu_dat_i[0]}]
set_input_delay -clock clk  280  [get_ports icpu_ack_i]
set_input_delay -clock clk  280  [get_ports icpu_rty_i]
set_input_delay -clock clk  280  [get_ports icpu_err_i]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[31]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[30]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[29]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[28]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[27]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[26]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[25]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[24]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[23]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[22]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[21]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[20]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[19]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[18]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[17]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[16]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[15]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[14]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[13]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[12]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[11]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[10]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[9]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[8]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[7]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[6]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[5]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[4]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[3]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[2]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[1]}]
set_input_delay -clock clk  280  [get_ports {icpu_adr_i[0]}]
set_input_delay -clock clk  280  [get_ports {icpu_tag_i[3]}]
set_input_delay -clock clk  280  [get_ports {icpu_tag_i[2]}]
set_input_delay -clock clk  280  [get_ports {icpu_tag_i[1]}]
set_input_delay -clock clk  280  [get_ports {icpu_tag_i[0]}]
set_input_delay -clock clk  280  [get_ports du_stall]
set_input_delay -clock clk  280  [get_ports {du_addr[31]}]
set_input_delay -clock clk  280  [get_ports {du_addr[30]}]
set_input_delay -clock clk  280  [get_ports {du_addr[29]}]
set_input_delay -clock clk  280  [get_ports {du_addr[28]}]
set_input_delay -clock clk  280  [get_ports {du_addr[27]}]
set_input_delay -clock clk  280  [get_ports {du_addr[26]}]
set_input_delay -clock clk  280  [get_ports {du_addr[25]}]
set_input_delay -clock clk  280  [get_ports {du_addr[24]}]
set_input_delay -clock clk  280  [get_ports {du_addr[23]}]
set_input_delay -clock clk  280  [get_ports {du_addr[22]}]
set_input_delay -clock clk  280  [get_ports {du_addr[21]}]
set_input_delay -clock clk  280  [get_ports {du_addr[20]}]
set_input_delay -clock clk  280  [get_ports {du_addr[19]}]
set_input_delay -clock clk  280  [get_ports {du_addr[18]}]
set_input_delay -clock clk  280  [get_ports {du_addr[17]}]
set_input_delay -clock clk  280  [get_ports {du_addr[16]}]
set_input_delay -clock clk  280  [get_ports {du_addr[15]}]
set_input_delay -clock clk  280  [get_ports {du_addr[14]}]
set_input_delay -clock clk  280  [get_ports {du_addr[13]}]
set_input_delay -clock clk  280  [get_ports {du_addr[12]}]
set_input_delay -clock clk  280  [get_ports {du_addr[11]}]
set_input_delay -clock clk  280  [get_ports {du_addr[10]}]
set_input_delay -clock clk  280  [get_ports {du_addr[9]}]
set_input_delay -clock clk  280  [get_ports {du_addr[8]}]
set_input_delay -clock clk  280  [get_ports {du_addr[7]}]
set_input_delay -clock clk  280  [get_ports {du_addr[6]}]
set_input_delay -clock clk  280  [get_ports {du_addr[5]}]
set_input_delay -clock clk  280  [get_ports {du_addr[4]}]
set_input_delay -clock clk  280  [get_ports {du_addr[3]}]
set_input_delay -clock clk  280  [get_ports {du_addr[2]}]
set_input_delay -clock clk  280  [get_ports {du_addr[1]}]
set_input_delay -clock clk  280  [get_ports {du_addr[0]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[31]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[30]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[29]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[28]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[27]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[26]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[25]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[24]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[23]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[22]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[21]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[20]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[19]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[18]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[17]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[16]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[15]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[14]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[13]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[12]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[11]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[10]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[9]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[8]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[7]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[6]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[5]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[4]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[3]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[2]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[1]}]
set_input_delay -clock clk  280  [get_ports {du_dat_du[0]}]
set_input_delay -clock clk  280  [get_ports du_read]
set_input_delay -clock clk  280  [get_ports du_write]
set_input_delay -clock clk  280  [get_ports du_flush_pipe]
set_input_delay -clock clk  280  [get_ports {du_dsr[13]}]
set_input_delay -clock clk  280  [get_ports {du_dsr[12]}]
set_input_delay -clock clk  280  [get_ports {du_dsr[11]}]
set_input_delay -clock clk  280  [get_ports {du_dsr[10]}]
set_input_delay -clock clk  280  [get_ports {du_dsr[9]}]
set_input_delay -clock clk  280  [get_ports {du_dsr[8]}]
set_input_delay -clock clk  280  [get_ports {du_dsr[7]}]
set_input_delay -clock clk  280  [get_ports {du_dsr[6]}]
set_input_delay -clock clk  280  [get_ports {du_dsr[5]}]
set_input_delay -clock clk  280  [get_ports {du_dsr[4]}]
set_input_delay -clock clk  280  [get_ports {du_dsr[3]}]
set_input_delay -clock clk  280  [get_ports {du_dsr[2]}]
set_input_delay -clock clk  280  [get_ports {du_dsr[1]}]
set_input_delay -clock clk  280  [get_ports {du_dsr[0]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[24]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[23]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[22]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[21]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[20]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[19]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[18]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[17]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[16]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[15]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[14]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[13]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[12]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[11]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[10]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[9]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[8]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[7]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[6]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[5]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[4]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[3]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[2]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[1]}]
set_input_delay -clock clk  280  [get_ports {du_dmr1[0]}]
set_input_delay -clock clk  280  [get_ports du_hwbkpt]
set_input_delay -clock clk  280  [get_ports du_hwbkpt_ls_r]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[31]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[30]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[29]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[28]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[27]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[26]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[25]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[24]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[23]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[22]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[21]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[20]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[19]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[18]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[17]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[16]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[15]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[14]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[13]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[12]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[11]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[10]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[9]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[8]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[7]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[6]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[5]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[4]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[3]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[2]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[1]}]
set_input_delay -clock clk  280  [get_ports {dcpu_dat_i[0]}]
set_input_delay -clock clk  280  [get_ports dcpu_ack_i]
set_input_delay -clock clk  280  [get_ports dcpu_rty_i]
set_input_delay -clock clk  280  [get_ports dcpu_err_i]
set_input_delay -clock clk  280  [get_ports {dcpu_tag_i[3]}]
set_input_delay -clock clk  280  [get_ports {dcpu_tag_i[2]}]
set_input_delay -clock clk  280  [get_ports {dcpu_tag_i[1]}]
set_input_delay -clock clk  280  [get_ports {dcpu_tag_i[0]}]
set_input_delay -clock clk  280  [get_ports boot_adr_sel_i]
set_input_delay -clock clk  280  [get_ports sig_int]
set_input_delay -clock clk  280  [get_ports sig_tick]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[31]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[30]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[29]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[28]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[27]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[26]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[25]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[24]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[23]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[22]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[21]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[20]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[19]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[18]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[17]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[16]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[15]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[14]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[13]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[12]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[11]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[10]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[9]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[8]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[7]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[6]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[5]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[4]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[3]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[2]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[1]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pic[0]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[31]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[30]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[29]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[28]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[27]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[26]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[25]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[24]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[23]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[22]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[21]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[20]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[19]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[18]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[17]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[16]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[15]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[14]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[13]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[12]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[11]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[10]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[9]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[8]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[7]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[6]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[5]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[4]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[3]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[2]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[1]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_tt[0]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[31]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[30]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[29]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[28]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[27]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[26]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[25]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[24]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[23]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[22]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[21]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[20]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[19]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[18]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[17]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[16]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[15]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[14]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[13]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[12]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[11]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[10]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[9]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[8]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[7]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[6]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[5]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[4]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[3]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[2]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[1]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_pm[0]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[31]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[30]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[29]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[28]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[27]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[26]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[25]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[24]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[23]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[22]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[21]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[20]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[19]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[18]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[17]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[16]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[15]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[14]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[13]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[12]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[11]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[10]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[9]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[8]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[7]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[6]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[5]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[4]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[3]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[2]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[1]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_dmmu[0]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[31]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[30]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[29]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[28]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[27]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[26]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[25]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[24]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[23]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[22]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[21]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[20]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[19]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[18]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[17]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[16]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[15]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[14]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[13]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[12]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[11]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[10]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[9]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[8]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[7]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[6]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[5]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[4]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[3]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[2]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[1]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_immu[0]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[31]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[30]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[29]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[28]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[27]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[26]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[25]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[24]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[23]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[22]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[21]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[20]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[19]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[18]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[17]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[16]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[15]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[14]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[13]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[12]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[11]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[10]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[9]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[8]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[7]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[6]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[5]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[4]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[3]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[2]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[1]}]
set_input_delay -clock clk  280  [get_ports {spr_dat_du[0]}]
set_input_delay -clock clk  280  [get_ports mtspr_dc_done]
set_output_delay -clock clk  280  [get_ports ic_en]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[31]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[30]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[29]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[28]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[27]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[26]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[25]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[24]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[23]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[22]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[21]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[20]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[19]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[18]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[17]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[16]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[15]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[14]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[13]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[12]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[11]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[10]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[9]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[8]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[7]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[6]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[5]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[4]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[3]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[2]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[1]}]
set_output_delay -clock clk  280  [get_ports {icpu_adr_o[0]}]
set_output_delay -clock clk  280  [get_ports icpu_cycstb_o]
set_output_delay -clock clk  280  [get_ports {icpu_sel_o[3]}]
set_output_delay -clock clk  280  [get_ports {icpu_sel_o[2]}]
set_output_delay -clock clk  280  [get_ports {icpu_sel_o[1]}]
set_output_delay -clock clk  280  [get_ports {icpu_sel_o[0]}]
set_output_delay -clock clk  280  [get_ports {icpu_tag_o[3]}]
set_output_delay -clock clk  280  [get_ports {icpu_tag_o[2]}]
set_output_delay -clock clk  280  [get_ports {icpu_tag_o[1]}]
set_output_delay -clock clk  280  [get_ports {icpu_tag_o[0]}]
set_output_delay -clock clk  280  [get_ports immu_en]
set_output_delay -clock clk  280  [get_ports id_void]
set_output_delay -clock clk  280  [get_ports {id_insn[31]}]
set_output_delay -clock clk  280  [get_ports {id_insn[30]}]
set_output_delay -clock clk  280  [get_ports {id_insn[29]}]
set_output_delay -clock clk  280  [get_ports {id_insn[28]}]
set_output_delay -clock clk  280  [get_ports {id_insn[27]}]
set_output_delay -clock clk  280  [get_ports {id_insn[26]}]
set_output_delay -clock clk  280  [get_ports {id_insn[25]}]
set_output_delay -clock clk  280  [get_ports {id_insn[24]}]
set_output_delay -clock clk  280  [get_ports {id_insn[23]}]
set_output_delay -clock clk  280  [get_ports {id_insn[22]}]
set_output_delay -clock clk  280  [get_ports {id_insn[21]}]
set_output_delay -clock clk  280  [get_ports {id_insn[20]}]
set_output_delay -clock clk  280  [get_ports {id_insn[19]}]
set_output_delay -clock clk  280  [get_ports {id_insn[18]}]
set_output_delay -clock clk  280  [get_ports {id_insn[17]}]
set_output_delay -clock clk  280  [get_ports {id_insn[16]}]
set_output_delay -clock clk  280  [get_ports {id_insn[15]}]
set_output_delay -clock clk  280  [get_ports {id_insn[14]}]
set_output_delay -clock clk  280  [get_ports {id_insn[13]}]
set_output_delay -clock clk  280  [get_ports {id_insn[12]}]
set_output_delay -clock clk  280  [get_ports {id_insn[11]}]
set_output_delay -clock clk  280  [get_ports {id_insn[10]}]
set_output_delay -clock clk  280  [get_ports {id_insn[9]}]
set_output_delay -clock clk  280  [get_ports {id_insn[8]}]
set_output_delay -clock clk  280  [get_ports {id_insn[7]}]
set_output_delay -clock clk  280  [get_ports {id_insn[6]}]
set_output_delay -clock clk  280  [get_ports {id_insn[5]}]
set_output_delay -clock clk  280  [get_ports {id_insn[4]}]
set_output_delay -clock clk  280  [get_ports {id_insn[3]}]
set_output_delay -clock clk  280  [get_ports {id_insn[2]}]
set_output_delay -clock clk  280  [get_ports {id_insn[1]}]
set_output_delay -clock clk  280  [get_ports {id_insn[0]}]
set_output_delay -clock clk  280  [get_ports ex_void]
set_output_delay -clock clk  280  [get_ports {ex_insn[31]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[30]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[29]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[28]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[27]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[26]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[25]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[24]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[23]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[22]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[21]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[20]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[19]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[18]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[17]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[16]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[15]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[14]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[13]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[12]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[11]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[10]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[9]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[8]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[7]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[6]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[5]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[4]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[3]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[2]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[1]}]
set_output_delay -clock clk  280  [get_ports {ex_insn[0]}]
set_output_delay -clock clk  280  [get_ports ex_freeze]
set_output_delay -clock clk  280  [get_ports {wb_insn[31]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[30]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[29]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[28]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[27]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[26]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[25]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[24]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[23]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[22]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[21]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[20]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[19]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[18]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[17]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[16]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[15]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[14]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[13]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[12]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[11]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[10]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[9]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[8]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[7]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[6]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[5]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[4]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[3]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[2]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[1]}]
set_output_delay -clock clk  280  [get_ports {wb_insn[0]}]
set_output_delay -clock clk  280  [get_ports wb_freeze]
set_output_delay -clock clk  280  [get_ports {id_pc[31]}]
set_output_delay -clock clk  280  [get_ports {id_pc[30]}]
set_output_delay -clock clk  280  [get_ports {id_pc[29]}]
set_output_delay -clock clk  280  [get_ports {id_pc[28]}]
set_output_delay -clock clk  280  [get_ports {id_pc[27]}]
set_output_delay -clock clk  280  [get_ports {id_pc[26]}]
set_output_delay -clock clk  280  [get_ports {id_pc[25]}]
set_output_delay -clock clk  280  [get_ports {id_pc[24]}]
set_output_delay -clock clk  280  [get_ports {id_pc[23]}]
set_output_delay -clock clk  280  [get_ports {id_pc[22]}]
set_output_delay -clock clk  280  [get_ports {id_pc[21]}]
set_output_delay -clock clk  280  [get_ports {id_pc[20]}]
set_output_delay -clock clk  280  [get_ports {id_pc[19]}]
set_output_delay -clock clk  280  [get_ports {id_pc[18]}]
set_output_delay -clock clk  280  [get_ports {id_pc[17]}]
set_output_delay -clock clk  280  [get_ports {id_pc[16]}]
set_output_delay -clock clk  280  [get_ports {id_pc[15]}]
set_output_delay -clock clk  280  [get_ports {id_pc[14]}]
set_output_delay -clock clk  280  [get_ports {id_pc[13]}]
set_output_delay -clock clk  280  [get_ports {id_pc[12]}]
set_output_delay -clock clk  280  [get_ports {id_pc[11]}]
set_output_delay -clock clk  280  [get_ports {id_pc[10]}]
set_output_delay -clock clk  280  [get_ports {id_pc[9]}]
set_output_delay -clock clk  280  [get_ports {id_pc[8]}]
set_output_delay -clock clk  280  [get_ports {id_pc[7]}]
set_output_delay -clock clk  280  [get_ports {id_pc[6]}]
set_output_delay -clock clk  280  [get_ports {id_pc[5]}]
set_output_delay -clock clk  280  [get_ports {id_pc[4]}]
set_output_delay -clock clk  280  [get_ports {id_pc[3]}]
set_output_delay -clock clk  280  [get_ports {id_pc[2]}]
set_output_delay -clock clk  280  [get_ports {id_pc[1]}]
set_output_delay -clock clk  280  [get_ports {id_pc[0]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[31]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[30]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[29]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[28]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[27]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[26]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[25]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[24]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[23]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[22]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[21]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[20]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[19]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[18]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[17]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[16]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[15]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[14]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[13]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[12]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[11]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[10]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[9]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[8]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[7]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[6]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[5]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[4]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[3]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[2]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[1]}]
set_output_delay -clock clk  280  [get_ports {ex_pc[0]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[31]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[30]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[29]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[28]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[27]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[26]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[25]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[24]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[23]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[22]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[21]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[20]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[19]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[18]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[17]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[16]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[15]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[14]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[13]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[12]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[11]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[10]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[9]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[8]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[7]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[6]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[5]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[4]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[3]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[2]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[1]}]
set_output_delay -clock clk  280  [get_ports {wb_pc[0]}]
set_output_delay -clock clk  280  [get_ports {branch_op[2]}]
set_output_delay -clock clk  280  [get_ports {branch_op[1]}]
set_output_delay -clock clk  280  [get_ports {branch_op[0]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[31]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[30]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[29]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[28]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[27]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[26]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[25]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[24]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[23]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[22]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[21]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[20]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[19]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[18]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[17]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[16]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[15]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[14]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[13]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[12]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[11]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[10]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[9]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[8]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[7]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[6]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[5]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[4]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[3]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[2]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[1]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_npc[0]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[31]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[30]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[29]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[28]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[27]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[26]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[25]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[24]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[23]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[22]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[21]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[20]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[19]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[18]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[17]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[16]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[15]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[14]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[13]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[12]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[11]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[10]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[9]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[8]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[7]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[6]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[5]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[4]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[3]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[2]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[1]}]
set_output_delay -clock clk  280  [get_ports {rf_dataw[0]}]
set_output_delay -clock clk  280  [get_ports ex_flushpipe]
set_output_delay -clock clk  280  [get_ports {du_except_stop[13]}]
set_output_delay -clock clk  280  [get_ports {du_except_stop[12]}]
set_output_delay -clock clk  280  [get_ports {du_except_stop[11]}]
set_output_delay -clock clk  280  [get_ports {du_except_stop[10]}]
set_output_delay -clock clk  280  [get_ports {du_except_stop[9]}]
set_output_delay -clock clk  280  [get_ports {du_except_stop[8]}]
set_output_delay -clock clk  280  [get_ports {du_except_stop[7]}]
set_output_delay -clock clk  280  [get_ports {du_except_stop[6]}]
set_output_delay -clock clk  280  [get_ports {du_except_stop[5]}]
set_output_delay -clock clk  280  [get_ports {du_except_stop[4]}]
set_output_delay -clock clk  280  [get_ports {du_except_stop[3]}]
set_output_delay -clock clk  280  [get_ports {du_except_stop[2]}]
set_output_delay -clock clk  280  [get_ports {du_except_stop[1]}]
set_output_delay -clock clk  280  [get_ports {du_except_stop[0]}]
set_output_delay -clock clk  280  [get_ports {du_except_trig[13]}]
set_output_delay -clock clk  280  [get_ports {du_except_trig[12]}]
set_output_delay -clock clk  280  [get_ports {du_except_trig[11]}]
set_output_delay -clock clk  280  [get_ports {du_except_trig[10]}]
set_output_delay -clock clk  280  [get_ports {du_except_trig[9]}]
set_output_delay -clock clk  280  [get_ports {du_except_trig[8]}]
set_output_delay -clock clk  280  [get_ports {du_except_trig[7]}]
set_output_delay -clock clk  280  [get_ports {du_except_trig[6]}]
set_output_delay -clock clk  280  [get_ports {du_except_trig[5]}]
set_output_delay -clock clk  280  [get_ports {du_except_trig[4]}]
set_output_delay -clock clk  280  [get_ports {du_except_trig[3]}]
set_output_delay -clock clk  280  [get_ports {du_except_trig[2]}]
set_output_delay -clock clk  280  [get_ports {du_except_trig[1]}]
set_output_delay -clock clk  280  [get_ports {du_except_trig[0]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[31]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[30]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[29]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[28]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[27]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[26]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[25]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[24]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[23]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[22]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[21]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[20]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[19]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[18]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[17]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[16]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[15]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[14]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[13]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[12]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[11]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[10]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[9]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[8]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[7]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[6]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[5]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[4]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[3]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[2]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[1]}]
set_output_delay -clock clk  280  [get_ports {du_dat_cpu[0]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[31]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[30]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[29]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[28]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[27]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[26]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[25]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[24]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[23]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[22]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[21]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[20]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[19]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[18]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[17]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[16]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[15]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[14]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[13]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[12]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[11]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[10]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[9]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[8]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[7]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[6]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[5]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[4]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[3]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[2]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[1]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_store_dat[0]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[31]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[30]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[29]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[28]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[27]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[26]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[25]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[24]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[23]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[22]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[21]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[20]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[19]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[18]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[17]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[16]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[15]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[14]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[13]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[12]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[11]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[10]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[9]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[8]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[7]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[6]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[5]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[4]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[3]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[2]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[1]}]
set_output_delay -clock clk  280  [get_ports {du_lsu_load_dat[0]}]
set_output_delay -clock clk  280  [get_ports abort_mvspr]
set_output_delay -clock clk  280  [get_ports abort_ex]
set_output_delay -clock clk  280  [get_ports dc_en]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[31]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[30]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[29]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[28]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[27]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[26]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[25]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[24]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[23]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[22]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[21]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[20]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[19]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[18]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[17]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[16]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[15]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[14]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[13]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[12]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[11]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[10]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[9]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[8]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[7]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[6]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[5]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[4]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[3]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[2]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[1]}]
set_output_delay -clock clk  280  [get_ports {dcpu_adr_o[0]}]
set_output_delay -clock clk  280  [get_ports dcpu_cycstb_o]
set_output_delay -clock clk  280  [get_ports dcpu_we_o]
set_output_delay -clock clk  280  [get_ports {dcpu_sel_o[3]}]
set_output_delay -clock clk  280  [get_ports {dcpu_sel_o[2]}]
set_output_delay -clock clk  280  [get_ports {dcpu_sel_o[1]}]
set_output_delay -clock clk  280  [get_ports {dcpu_sel_o[0]}]
set_output_delay -clock clk  280  [get_ports {dcpu_tag_o[3]}]
set_output_delay -clock clk  280  [get_ports {dcpu_tag_o[2]}]
set_output_delay -clock clk  280  [get_ports {dcpu_tag_o[1]}]
set_output_delay -clock clk  280  [get_ports {dcpu_tag_o[0]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[31]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[30]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[29]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[28]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[27]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[26]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[25]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[24]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[23]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[22]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[21]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[20]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[19]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[18]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[17]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[16]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[15]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[14]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[13]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[12]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[11]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[10]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[9]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[8]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[7]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[6]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[5]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[4]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[3]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[2]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[1]}]
set_output_delay -clock clk  280  [get_ports {dcpu_dat_o[0]}]
set_output_delay -clock clk  280  [get_ports sb_en]
set_output_delay -clock clk  280  [get_ports dmmu_en]
set_output_delay -clock clk  280  [get_ports dc_no_writethrough]
set_output_delay -clock clk  280  [get_ports supv]
set_output_delay -clock clk  280  [get_ports {spr_addr[31]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[30]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[29]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[28]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[27]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[26]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[25]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[24]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[23]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[22]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[21]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[20]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[19]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[18]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[17]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[16]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[15]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[14]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[13]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[12]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[11]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[10]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[9]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[8]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[7]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[6]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[5]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[4]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[3]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[2]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[1]}]
set_output_delay -clock clk  280  [get_ports {spr_addr[0]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[31]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[30]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[29]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[28]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[27]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[26]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[25]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[24]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[23]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[22]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[21]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[20]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[19]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[18]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[17]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[16]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[15]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[14]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[13]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[12]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[11]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[10]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[9]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[8]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[7]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[6]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[5]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[4]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[3]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[2]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[1]}]
set_output_delay -clock clk  280  [get_ports {spr_dat_cpu[0]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[31]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[30]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[29]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[28]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[27]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[26]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[25]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[24]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[23]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[22]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[21]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[20]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[19]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[18]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[17]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[16]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[15]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[14]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[13]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[12]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[11]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[10]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[9]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[8]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[7]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[6]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[5]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[4]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[3]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[2]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[1]}]
set_output_delay -clock clk  280  [get_ports {spr_cs[0]}]
set_output_delay -clock clk  280  [get_ports spr_we]
