###################################################################

# Created by write_sdc on Sun Dec 21 13:27:37 2025

###################################################################
set sdc_version 2.1

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current uA
set_max_area 0
create_clock [get_ports clk]  -period 2000  -waveform {0 1000}
set_clock_uncertainty -setup 100  [get_clocks clk]
set_input_delay -clock clk  280  [get_ports clk]
set_input_delay -clock clk  280  [get_ports rst]
set_input_delay -clock clk  280  [get_ports init]
set_input_delay -clock clk  280  [get_ports next]
set_input_delay -clock clk  280  [get_ports {w_data[31]}]
set_input_delay -clock clk  280  [get_ports {w_data[30]}]
set_input_delay -clock clk  280  [get_ports {w_data[29]}]
set_input_delay -clock clk  280  [get_ports {w_data[28]}]
set_input_delay -clock clk  280  [get_ports {w_data[27]}]
set_input_delay -clock clk  280  [get_ports {w_data[26]}]
set_input_delay -clock clk  280  [get_ports {w_data[25]}]
set_input_delay -clock clk  280  [get_ports {w_data[24]}]
set_input_delay -clock clk  280  [get_ports {w_data[23]}]
set_input_delay -clock clk  280  [get_ports {w_data[22]}]
set_input_delay -clock clk  280  [get_ports {w_data[21]}]
set_input_delay -clock clk  280  [get_ports {w_data[20]}]
set_input_delay -clock clk  280  [get_ports {w_data[19]}]
set_input_delay -clock clk  280  [get_ports {w_data[18]}]
set_input_delay -clock clk  280  [get_ports {w_data[17]}]
set_input_delay -clock clk  280  [get_ports {w_data[16]}]
set_input_delay -clock clk  280  [get_ports {w_data[15]}]
set_input_delay -clock clk  280  [get_ports {w_data[14]}]
set_input_delay -clock clk  280  [get_ports {w_data[13]}]
set_input_delay -clock clk  280  [get_ports {w_data[12]}]
set_input_delay -clock clk  280  [get_ports {w_data[11]}]
set_input_delay -clock clk  280  [get_ports {w_data[10]}]
set_input_delay -clock clk  280  [get_ports {w_data[9]}]
set_input_delay -clock clk  280  [get_ports {w_data[8]}]
set_input_delay -clock clk  280  [get_ports {w_data[7]}]
set_input_delay -clock clk  280  [get_ports {w_data[6]}]
set_input_delay -clock clk  280  [get_ports {w_data[5]}]
set_input_delay -clock clk  280  [get_ports {w_data[4]}]
set_input_delay -clock clk  280  [get_ports {w_data[3]}]
set_input_delay -clock clk  280  [get_ports {w_data[2]}]
set_input_delay -clock clk  280  [get_ports {w_data[1]}]
set_input_delay -clock clk  280  [get_ports {w_data[0]}]
set_output_delay -clock clk  280  [get_ports w_init]
set_output_delay -clock clk  280  [get_ports w_next]
set_output_delay -clock clk  280  [get_ports ready]
set_output_delay -clock clk  280  [get_ports {digest[255]}]
set_output_delay -clock clk  280  [get_ports {digest[254]}]
set_output_delay -clock clk  280  [get_ports {digest[253]}]
set_output_delay -clock clk  280  [get_ports {digest[252]}]
set_output_delay -clock clk  280  [get_ports {digest[251]}]
set_output_delay -clock clk  280  [get_ports {digest[250]}]
set_output_delay -clock clk  280  [get_ports {digest[249]}]
set_output_delay -clock clk  280  [get_ports {digest[248]}]
set_output_delay -clock clk  280  [get_ports {digest[247]}]
set_output_delay -clock clk  280  [get_ports {digest[246]}]
set_output_delay -clock clk  280  [get_ports {digest[245]}]
set_output_delay -clock clk  280  [get_ports {digest[244]}]
set_output_delay -clock clk  280  [get_ports {digest[243]}]
set_output_delay -clock clk  280  [get_ports {digest[242]}]
set_output_delay -clock clk  280  [get_ports {digest[241]}]
set_output_delay -clock clk  280  [get_ports {digest[240]}]
set_output_delay -clock clk  280  [get_ports {digest[239]}]
set_output_delay -clock clk  280  [get_ports {digest[238]}]
set_output_delay -clock clk  280  [get_ports {digest[237]}]
set_output_delay -clock clk  280  [get_ports {digest[236]}]
set_output_delay -clock clk  280  [get_ports {digest[235]}]
set_output_delay -clock clk  280  [get_ports {digest[234]}]
set_output_delay -clock clk  280  [get_ports {digest[233]}]
set_output_delay -clock clk  280  [get_ports {digest[232]}]
set_output_delay -clock clk  280  [get_ports {digest[231]}]
set_output_delay -clock clk  280  [get_ports {digest[230]}]
set_output_delay -clock clk  280  [get_ports {digest[229]}]
set_output_delay -clock clk  280  [get_ports {digest[228]}]
set_output_delay -clock clk  280  [get_ports {digest[227]}]
set_output_delay -clock clk  280  [get_ports {digest[226]}]
set_output_delay -clock clk  280  [get_ports {digest[225]}]
set_output_delay -clock clk  280  [get_ports {digest[224]}]
set_output_delay -clock clk  280  [get_ports {digest[223]}]
set_output_delay -clock clk  280  [get_ports {digest[222]}]
set_output_delay -clock clk  280  [get_ports {digest[221]}]
set_output_delay -clock clk  280  [get_ports {digest[220]}]
set_output_delay -clock clk  280  [get_ports {digest[219]}]
set_output_delay -clock clk  280  [get_ports {digest[218]}]
set_output_delay -clock clk  280  [get_ports {digest[217]}]
set_output_delay -clock clk  280  [get_ports {digest[216]}]
set_output_delay -clock clk  280  [get_ports {digest[215]}]
set_output_delay -clock clk  280  [get_ports {digest[214]}]
set_output_delay -clock clk  280  [get_ports {digest[213]}]
set_output_delay -clock clk  280  [get_ports {digest[212]}]
set_output_delay -clock clk  280  [get_ports {digest[211]}]
set_output_delay -clock clk  280  [get_ports {digest[210]}]
set_output_delay -clock clk  280  [get_ports {digest[209]}]
set_output_delay -clock clk  280  [get_ports {digest[208]}]
set_output_delay -clock clk  280  [get_ports {digest[207]}]
set_output_delay -clock clk  280  [get_ports {digest[206]}]
set_output_delay -clock clk  280  [get_ports {digest[205]}]
set_output_delay -clock clk  280  [get_ports {digest[204]}]
set_output_delay -clock clk  280  [get_ports {digest[203]}]
set_output_delay -clock clk  280  [get_ports {digest[202]}]
set_output_delay -clock clk  280  [get_ports {digest[201]}]
set_output_delay -clock clk  280  [get_ports {digest[200]}]
set_output_delay -clock clk  280  [get_ports {digest[199]}]
set_output_delay -clock clk  280  [get_ports {digest[198]}]
set_output_delay -clock clk  280  [get_ports {digest[197]}]
set_output_delay -clock clk  280  [get_ports {digest[196]}]
set_output_delay -clock clk  280  [get_ports {digest[195]}]
set_output_delay -clock clk  280  [get_ports {digest[194]}]
set_output_delay -clock clk  280  [get_ports {digest[193]}]
set_output_delay -clock clk  280  [get_ports {digest[192]}]
set_output_delay -clock clk  280  [get_ports {digest[191]}]
set_output_delay -clock clk  280  [get_ports {digest[190]}]
set_output_delay -clock clk  280  [get_ports {digest[189]}]
set_output_delay -clock clk  280  [get_ports {digest[188]}]
set_output_delay -clock clk  280  [get_ports {digest[187]}]
set_output_delay -clock clk  280  [get_ports {digest[186]}]
set_output_delay -clock clk  280  [get_ports {digest[185]}]
set_output_delay -clock clk  280  [get_ports {digest[184]}]
set_output_delay -clock clk  280  [get_ports {digest[183]}]
set_output_delay -clock clk  280  [get_ports {digest[182]}]
set_output_delay -clock clk  280  [get_ports {digest[181]}]
set_output_delay -clock clk  280  [get_ports {digest[180]}]
set_output_delay -clock clk  280  [get_ports {digest[179]}]
set_output_delay -clock clk  280  [get_ports {digest[178]}]
set_output_delay -clock clk  280  [get_ports {digest[177]}]
set_output_delay -clock clk  280  [get_ports {digest[176]}]
set_output_delay -clock clk  280  [get_ports {digest[175]}]
set_output_delay -clock clk  280  [get_ports {digest[174]}]
set_output_delay -clock clk  280  [get_ports {digest[173]}]
set_output_delay -clock clk  280  [get_ports {digest[172]}]
set_output_delay -clock clk  280  [get_ports {digest[171]}]
set_output_delay -clock clk  280  [get_ports {digest[170]}]
set_output_delay -clock clk  280  [get_ports {digest[169]}]
set_output_delay -clock clk  280  [get_ports {digest[168]}]
set_output_delay -clock clk  280  [get_ports {digest[167]}]
set_output_delay -clock clk  280  [get_ports {digest[166]}]
set_output_delay -clock clk  280  [get_ports {digest[165]}]
set_output_delay -clock clk  280  [get_ports {digest[164]}]
set_output_delay -clock clk  280  [get_ports {digest[163]}]
set_output_delay -clock clk  280  [get_ports {digest[162]}]
set_output_delay -clock clk  280  [get_ports {digest[161]}]
set_output_delay -clock clk  280  [get_ports {digest[160]}]
set_output_delay -clock clk  280  [get_ports {digest[159]}]
set_output_delay -clock clk  280  [get_ports {digest[158]}]
set_output_delay -clock clk  280  [get_ports {digest[157]}]
set_output_delay -clock clk  280  [get_ports {digest[156]}]
set_output_delay -clock clk  280  [get_ports {digest[155]}]
set_output_delay -clock clk  280  [get_ports {digest[154]}]
set_output_delay -clock clk  280  [get_ports {digest[153]}]
set_output_delay -clock clk  280  [get_ports {digest[152]}]
set_output_delay -clock clk  280  [get_ports {digest[151]}]
set_output_delay -clock clk  280  [get_ports {digest[150]}]
set_output_delay -clock clk  280  [get_ports {digest[149]}]
set_output_delay -clock clk  280  [get_ports {digest[148]}]
set_output_delay -clock clk  280  [get_ports {digest[147]}]
set_output_delay -clock clk  280  [get_ports {digest[146]}]
set_output_delay -clock clk  280  [get_ports {digest[145]}]
set_output_delay -clock clk  280  [get_ports {digest[144]}]
set_output_delay -clock clk  280  [get_ports {digest[143]}]
set_output_delay -clock clk  280  [get_ports {digest[142]}]
set_output_delay -clock clk  280  [get_ports {digest[141]}]
set_output_delay -clock clk  280  [get_ports {digest[140]}]
set_output_delay -clock clk  280  [get_ports {digest[139]}]
set_output_delay -clock clk  280  [get_ports {digest[138]}]
set_output_delay -clock clk  280  [get_ports {digest[137]}]
set_output_delay -clock clk  280  [get_ports {digest[136]}]
set_output_delay -clock clk  280  [get_ports {digest[135]}]
set_output_delay -clock clk  280  [get_ports {digest[134]}]
set_output_delay -clock clk  280  [get_ports {digest[133]}]
set_output_delay -clock clk  280  [get_ports {digest[132]}]
set_output_delay -clock clk  280  [get_ports {digest[131]}]
set_output_delay -clock clk  280  [get_ports {digest[130]}]
set_output_delay -clock clk  280  [get_ports {digest[129]}]
set_output_delay -clock clk  280  [get_ports {digest[128]}]
set_output_delay -clock clk  280  [get_ports {digest[127]}]
set_output_delay -clock clk  280  [get_ports {digest[126]}]
set_output_delay -clock clk  280  [get_ports {digest[125]}]
set_output_delay -clock clk  280  [get_ports {digest[124]}]
set_output_delay -clock clk  280  [get_ports {digest[123]}]
set_output_delay -clock clk  280  [get_ports {digest[122]}]
set_output_delay -clock clk  280  [get_ports {digest[121]}]
set_output_delay -clock clk  280  [get_ports {digest[120]}]
set_output_delay -clock clk  280  [get_ports {digest[119]}]
set_output_delay -clock clk  280  [get_ports {digest[118]}]
set_output_delay -clock clk  280  [get_ports {digest[117]}]
set_output_delay -clock clk  280  [get_ports {digest[116]}]
set_output_delay -clock clk  280  [get_ports {digest[115]}]
set_output_delay -clock clk  280  [get_ports {digest[114]}]
set_output_delay -clock clk  280  [get_ports {digest[113]}]
set_output_delay -clock clk  280  [get_ports {digest[112]}]
set_output_delay -clock clk  280  [get_ports {digest[111]}]
set_output_delay -clock clk  280  [get_ports {digest[110]}]
set_output_delay -clock clk  280  [get_ports {digest[109]}]
set_output_delay -clock clk  280  [get_ports {digest[108]}]
set_output_delay -clock clk  280  [get_ports {digest[107]}]
set_output_delay -clock clk  280  [get_ports {digest[106]}]
set_output_delay -clock clk  280  [get_ports {digest[105]}]
set_output_delay -clock clk  280  [get_ports {digest[104]}]
set_output_delay -clock clk  280  [get_ports {digest[103]}]
set_output_delay -clock clk  280  [get_ports {digest[102]}]
set_output_delay -clock clk  280  [get_ports {digest[101]}]
set_output_delay -clock clk  280  [get_ports {digest[100]}]
set_output_delay -clock clk  280  [get_ports {digest[99]}]
set_output_delay -clock clk  280  [get_ports {digest[98]}]
set_output_delay -clock clk  280  [get_ports {digest[97]}]
set_output_delay -clock clk  280  [get_ports {digest[96]}]
set_output_delay -clock clk  280  [get_ports {digest[95]}]
set_output_delay -clock clk  280  [get_ports {digest[94]}]
set_output_delay -clock clk  280  [get_ports {digest[93]}]
set_output_delay -clock clk  280  [get_ports {digest[92]}]
set_output_delay -clock clk  280  [get_ports {digest[91]}]
set_output_delay -clock clk  280  [get_ports {digest[90]}]
set_output_delay -clock clk  280  [get_ports {digest[89]}]
set_output_delay -clock clk  280  [get_ports {digest[88]}]
set_output_delay -clock clk  280  [get_ports {digest[87]}]
set_output_delay -clock clk  280  [get_ports {digest[86]}]
set_output_delay -clock clk  280  [get_ports {digest[85]}]
set_output_delay -clock clk  280  [get_ports {digest[84]}]
set_output_delay -clock clk  280  [get_ports {digest[83]}]
set_output_delay -clock clk  280  [get_ports {digest[82]}]
set_output_delay -clock clk  280  [get_ports {digest[81]}]
set_output_delay -clock clk  280  [get_ports {digest[80]}]
set_output_delay -clock clk  280  [get_ports {digest[79]}]
set_output_delay -clock clk  280  [get_ports {digest[78]}]
set_output_delay -clock clk  280  [get_ports {digest[77]}]
set_output_delay -clock clk  280  [get_ports {digest[76]}]
set_output_delay -clock clk  280  [get_ports {digest[75]}]
set_output_delay -clock clk  280  [get_ports {digest[74]}]
set_output_delay -clock clk  280  [get_ports {digest[73]}]
set_output_delay -clock clk  280  [get_ports {digest[72]}]
set_output_delay -clock clk  280  [get_ports {digest[71]}]
set_output_delay -clock clk  280  [get_ports {digest[70]}]
set_output_delay -clock clk  280  [get_ports {digest[69]}]
set_output_delay -clock clk  280  [get_ports {digest[68]}]
set_output_delay -clock clk  280  [get_ports {digest[67]}]
set_output_delay -clock clk  280  [get_ports {digest[66]}]
set_output_delay -clock clk  280  [get_ports {digest[65]}]
set_output_delay -clock clk  280  [get_ports {digest[64]}]
set_output_delay -clock clk  280  [get_ports {digest[63]}]
set_output_delay -clock clk  280  [get_ports {digest[62]}]
set_output_delay -clock clk  280  [get_ports {digest[61]}]
set_output_delay -clock clk  280  [get_ports {digest[60]}]
set_output_delay -clock clk  280  [get_ports {digest[59]}]
set_output_delay -clock clk  280  [get_ports {digest[58]}]
set_output_delay -clock clk  280  [get_ports {digest[57]}]
set_output_delay -clock clk  280  [get_ports {digest[56]}]
set_output_delay -clock clk  280  [get_ports {digest[55]}]
set_output_delay -clock clk  280  [get_ports {digest[54]}]
set_output_delay -clock clk  280  [get_ports {digest[53]}]
set_output_delay -clock clk  280  [get_ports {digest[52]}]
set_output_delay -clock clk  280  [get_ports {digest[51]}]
set_output_delay -clock clk  280  [get_ports {digest[50]}]
set_output_delay -clock clk  280  [get_ports {digest[49]}]
set_output_delay -clock clk  280  [get_ports {digest[48]}]
set_output_delay -clock clk  280  [get_ports {digest[47]}]
set_output_delay -clock clk  280  [get_ports {digest[46]}]
set_output_delay -clock clk  280  [get_ports {digest[45]}]
set_output_delay -clock clk  280  [get_ports {digest[44]}]
set_output_delay -clock clk  280  [get_ports {digest[43]}]
set_output_delay -clock clk  280  [get_ports {digest[42]}]
set_output_delay -clock clk  280  [get_ports {digest[41]}]
set_output_delay -clock clk  280  [get_ports {digest[40]}]
set_output_delay -clock clk  280  [get_ports {digest[39]}]
set_output_delay -clock clk  280  [get_ports {digest[38]}]
set_output_delay -clock clk  280  [get_ports {digest[37]}]
set_output_delay -clock clk  280  [get_ports {digest[36]}]
set_output_delay -clock clk  280  [get_ports {digest[35]}]
set_output_delay -clock clk  280  [get_ports {digest[34]}]
set_output_delay -clock clk  280  [get_ports {digest[33]}]
set_output_delay -clock clk  280  [get_ports {digest[32]}]
set_output_delay -clock clk  280  [get_ports {digest[31]}]
set_output_delay -clock clk  280  [get_ports {digest[30]}]
set_output_delay -clock clk  280  [get_ports {digest[29]}]
set_output_delay -clock clk  280  [get_ports {digest[28]}]
set_output_delay -clock clk  280  [get_ports {digest[27]}]
set_output_delay -clock clk  280  [get_ports {digest[26]}]
set_output_delay -clock clk  280  [get_ports {digest[25]}]
set_output_delay -clock clk  280  [get_ports {digest[24]}]
set_output_delay -clock clk  280  [get_ports {digest[23]}]
set_output_delay -clock clk  280  [get_ports {digest[22]}]
set_output_delay -clock clk  280  [get_ports {digest[21]}]
set_output_delay -clock clk  280  [get_ports {digest[20]}]
set_output_delay -clock clk  280  [get_ports {digest[19]}]
set_output_delay -clock clk  280  [get_ports {digest[18]}]
set_output_delay -clock clk  280  [get_ports {digest[17]}]
set_output_delay -clock clk  280  [get_ports {digest[16]}]
set_output_delay -clock clk  280  [get_ports {digest[15]}]
set_output_delay -clock clk  280  [get_ports {digest[14]}]
set_output_delay -clock clk  280  [get_ports {digest[13]}]
set_output_delay -clock clk  280  [get_ports {digest[12]}]
set_output_delay -clock clk  280  [get_ports {digest[11]}]
set_output_delay -clock clk  280  [get_ports {digest[10]}]
set_output_delay -clock clk  280  [get_ports {digest[9]}]
set_output_delay -clock clk  280  [get_ports {digest[8]}]
set_output_delay -clock clk  280  [get_ports {digest[7]}]
set_output_delay -clock clk  280  [get_ports {digest[6]}]
set_output_delay -clock clk  280  [get_ports {digest[5]}]
set_output_delay -clock clk  280  [get_ports {digest[4]}]
set_output_delay -clock clk  280  [get_ports {digest[3]}]
set_output_delay -clock clk  280  [get_ports {digest[2]}]
set_output_delay -clock clk  280  [get_ports {digest[1]}]
set_output_delay -clock clk  280  [get_ports {digest[0]}]
set_output_delay -clock clk  280  [get_ports digest_valid]
